program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "3520.4.1"}, {"coremlc-version", "3520.5.1"}, {"coremltools-component-torch", "2.8.0"}, {"coremltools-source-dialect", "TorchScript"}, {"coremltools-version", "9.0"}})]
{
    func main<ios16>(tensor<fp32, [1, 3, 224, 224]> image) {
            tensor<fp32, []> image__scaled___y_0 = const()[name = tensor<string, []>("image__scaled___y_0"), val = tensor<fp32, []>(0x1.010102p-8)];
            tensor<fp32, [1, 3, 224, 224]> image__scaled__ = mul(x = image, y = image__scaled___y_0)[name = tensor<string, []>("image__scaled__")];
            tensor<string, []> image_to_fp16_dtype_0 = const()[name = tensor<string, []>("image_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, [1, 3, 1, 1]> mean_to_fp16 = const()[name = tensor<string, []>("mean_to_fp16"), val = tensor<fp16, [1, 3, 1, 1]>([[[[0x1.f0cp-2]], [[0x1.d3p-2]], [[0x1.9fcp-2]]]])];
            tensor<fp16, [1, 3, 224, 224]> image_to_fp16 = cast(dtype = image_to_fp16_dtype_0, x = image__scaled__)[name = tensor<string, []>("cast_30")];
            tensor<fp16, [1, 3, 224, 224]> var_6_cast_fp16 = sub(x = image_to_fp16, y = mean_to_fp16)[name = tensor<string, []>("op_6_cast_fp16")];
            tensor<fp16, [1, 3, 1, 1]> _inversed_x_3_y_0_to_fp16 = const()[name = tensor<string, []>("_inversed_x_3_y_0_to_fp16"), val = tensor<fp16, [1, 3, 1, 1]>([[[[0x1.178p+2]], [[0x1.1dcp+2]], [[0x1.1c8p+2]]]])];
            tensor<fp16, [1, 3, 224, 224]> _inversed_x_3_cast_fp16 = mul(x = var_6_cast_fp16, y = _inversed_x_3_y_0_to_fp16)[name = tensor<string, []>("_inversed_x_3_cast_fp16")];
            tensor<int32, []> var_19 = const()[name = tensor<string, []>("op_19"), val = tensor<int32, []>(1)];
            tensor<string, []> x_5_pad_type_0 = const()[name = tensor<string, []>("x_5_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> x_5_strides_0 = const()[name = tensor<string, []>("x_5_strides_0"), val = tensor<int32, [2]>([14, 14])];
            tensor<int32, [4]> x_5_pad_0 = const()[name = tensor<string, []>("x_5_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> x_5_dilations_0 = const()[name = tensor<string, []>("x_5_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> x_5_groups_0 = const()[name = tensor<string, []>("x_5_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [384, 3, 14, 14]> backbone_patch_embed_proj_weight_to_fp16 = const()[name = tensor<string, []>("backbone_patch_embed_proj_weight_to_fp16"), val = tensor<fp16, [384, 3, 14, 14]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [384]> backbone_patch_embed_proj_bias_to_fp16 = const()[name = tensor<string, []>("backbone_patch_embed_proj_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(451712)))];
            tensor<fp16, [1, 384, 16, 16]> x_5_cast_fp16 = conv(bias = backbone_patch_embed_proj_bias_to_fp16, dilations = x_5_dilations_0, groups = x_5_groups_0, pad = x_5_pad_0, pad_type = x_5_pad_type_0, strides = x_5_strides_0, weight = backbone_patch_embed_proj_weight_to_fp16, x = _inversed_x_3_cast_fp16)[name = tensor<string, []>("x_5_cast_fp16")];
            tensor<int32, [3]> concat_0 = const()[name = tensor<string, []>("concat_0"), val = tensor<int32, [3]>([1, 384, 256])];
            tensor<fp16, [1, 384, 256]> var_60_cast_fp16 = reshape(shape = concat_0, x = x_5_cast_fp16)[name = tensor<string, []>("op_60_cast_fp16")];
            tensor<int32, [3]> x_7_perm_0 = const()[name = tensor<string, []>("x_7_perm_0"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<bool, []> x_9_interleave_0 = const()[name = tensor<string, []>("x_9_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 1, 384]> backbone_cls_token_to_fp16 = const()[name = tensor<string, []>("backbone_cls_token_to_fp16"), val = tensor<fp16, [1, 1, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(452544)))];
            tensor<fp16, [1, 256, 384]> x_7_cast_fp16 = transpose(perm = x_7_perm_0, x = var_60_cast_fp16)[name = tensor<string, []>("transpose_120")];
            tensor<fp16, [1, 257, 384]> x_9_cast_fp16 = concat(axis = var_19, interleave = x_9_interleave_0, values = (backbone_cls_token_to_fp16, x_7_cast_fp16))[name = tensor<string, []>("x_9_cast_fp16")];
            tensor<fp16, [1, 257, 384]> backbone_pos_embed_to_fp16 = const()[name = tensor<string, []>("backbone_pos_embed_to_fp16"), val = tensor<fp16, [1, 257, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(453376)))];
            tensor<fp16, [1, 257, 384]> input_1_cast_fp16 = add(x = x_9_cast_fp16, y = backbone_pos_embed_to_fp16)[name = tensor<string, []>("input_1_cast_fp16")];
            tensor<int32, [1]> x_11_axes_0 = const()[name = tensor<string, []>("x_11_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> backbone_blocks_0_norm1_weight_to_fp16 = const()[name = tensor<string, []>("backbone_blocks_0_norm1_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(650816)))];
            tensor<fp16, [384]> backbone_blocks_0_norm1_bias_to_fp16 = const()[name = tensor<string, []>("backbone_blocks_0_norm1_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(651648)))];
            tensor<fp16, []> var_9_to_fp16 = const()[name = tensor<string, []>("op_9_to_fp16"), val = tensor<fp16, []>(0x1.1p-20)];
            tensor<fp16, [1, 257, 384]> x_11_cast_fp16 = layer_norm(axes = x_11_axes_0, beta = backbone_blocks_0_norm1_bias_to_fp16, epsilon = var_9_to_fp16, gamma = backbone_blocks_0_norm1_weight_to_fp16, x = input_1_cast_fp16)[name = tensor<string, []>("x_11_cast_fp16")];
            tensor<fp16, [1152, 384]> backbone_blocks_0_attn_qkv_weight_to_fp16 = const()[name = tensor<string, []>("backbone_blocks_0_attn_qkv_weight_to_fp16"), val = tensor<fp16, [1152, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(652480)))];
            tensor<fp16, [1152]> backbone_blocks_0_attn_qkv_bias_to_fp16 = const()[name = tensor<string, []>("backbone_blocks_0_attn_qkv_bias_to_fp16"), val = tensor<fp16, [1152]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1537280)))];
            tensor<fp16, [1, 257, 1152]> linear_0_cast_fp16 = linear(bias = backbone_blocks_0_attn_qkv_bias_to_fp16, weight = backbone_blocks_0_attn_qkv_weight_to_fp16, x = x_11_cast_fp16)[name = tensor<string, []>("linear_0_cast_fp16")];
            tensor<int32, [5]> var_89 = const()[name = tensor<string, []>("op_89"), val = tensor<int32, [5]>([1, 257, 3, 6, 64])];
            tensor<fp16, [1, 257, 3, 6, 64]> qkv_1_cast_fp16 = reshape(shape = var_89, x = linear_0_cast_fp16)[name = tensor<string, []>("qkv_1_cast_fp16")];
            tensor<int32, [3]> var_91_split_sizes_0 = const()[name = tensor<string, []>("op_91_split_sizes_0"), val = tensor<int32, [3]>([1, 1, 1])];
            tensor<int32, []> var_91_axis_0 = const()[name = tensor<string, []>("op_91_axis_0"), val = tensor<int32, []>(2)];
            tensor<fp16, [1, 257, 1, 6, 64]> var_91_cast_fp16_0, tensor<fp16, [1, 257, 1, 6, 64]> var_91_cast_fp16_1, tensor<fp16, [1, 257, 1, 6, 64]> var_91_cast_fp16_2 = split(axis = var_91_axis_0, split_sizes = var_91_split_sizes_0, x = qkv_1_cast_fp16)[name = tensor<string, []>("op_91_cast_fp16")];
            tensor<int32, [1]> squeeze_0_axes_0 = const()[name = tensor<string, []>("squeeze_0_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<fp16, [1, 257, 6, 64]> squeeze_0_cast_fp16 = squeeze(axes = squeeze_0_axes_0, x = var_91_cast_fp16_0)[name = tensor<string, []>("squeeze_0_cast_fp16")];
            tensor<int32, [1]> squeeze_1_axes_0 = const()[name = tensor<string, []>("squeeze_1_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<fp16, [1, 257, 6, 64]> squeeze_1_cast_fp16 = squeeze(axes = squeeze_1_axes_0, x = var_91_cast_fp16_1)[name = tensor<string, []>("squeeze_1_cast_fp16")];
            tensor<int32, [1]> squeeze_2_axes_0 = const()[name = tensor<string, []>("squeeze_2_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<fp16, [1, 257, 6, 64]> squeeze_2_cast_fp16 = squeeze(axes = squeeze_2_axes_0, x = var_91_cast_fp16_2)[name = tensor<string, []>("squeeze_2_cast_fp16")];
            tensor<int32, [4]> v_1_perm_0 = const()[name = tensor<string, []>("v_1_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, []> mul_0_y_0_to_fp16 = const()[name = tensor<string, []>("mul_0_y_0_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 257, 6, 64]> mul_0_cast_fp16 = mul(x = squeeze_0_cast_fp16, y = mul_0_y_0_to_fp16)[name = tensor<string, []>("mul_0_cast_fp16")];
            tensor<bool, []> matmul_0_transpose_y_0 = const()[name = tensor<string, []>("matmul_0_transpose_y_0"), val = tensor<bool, []>(true)];
            tensor<bool, []> matmul_0_transpose_x_0 = const()[name = tensor<string, []>("matmul_0_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> transpose_48_perm_0 = const()[name = tensor<string, []>("transpose_48_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<int32, [4]> transpose_49_perm_0 = const()[name = tensor<string, []>("transpose_49_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<fp16, [1, 6, 257, 64]> transpose_49 = transpose(perm = transpose_49_perm_0, x = squeeze_1_cast_fp16)[name = tensor<string, []>("transpose_117")];
            tensor<fp16, [1, 6, 257, 64]> transpose_48 = transpose(perm = transpose_48_perm_0, x = mul_0_cast_fp16)[name = tensor<string, []>("transpose_118")];
            tensor<fp16, [1, 6, 257, 257]> matmul_0_cast_fp16 = matmul(transpose_x = matmul_0_transpose_x_0, transpose_y = matmul_0_transpose_y_0, x = transpose_48, y = transpose_49)[name = tensor<string, []>("matmul_0_cast_fp16")];
            tensor<int32, []> softmax_0_axis_0 = const()[name = tensor<string, []>("softmax_0_axis_0"), val = tensor<int32, []>(-1)];
            tensor<fp16, [1, 6, 257, 257]> softmax_0_cast_fp16 = softmax(axis = softmax_0_axis_0, x = matmul_0_cast_fp16)[name = tensor<string, []>("softmax_0_cast_fp16")];
            tensor<bool, []> x_13_transpose_x_0 = const()[name = tensor<string, []>("x_13_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> x_13_transpose_y_0 = const()[name = tensor<string, []>("x_13_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 6, 257, 64]> v_1_cast_fp16 = transpose(perm = v_1_perm_0, x = squeeze_2_cast_fp16)[name = tensor<string, []>("transpose_119")];
            tensor<fp16, [1, 6, 257, 64]> x_13_cast_fp16 = matmul(transpose_x = x_13_transpose_x_0, transpose_y = x_13_transpose_y_0, x = softmax_0_cast_fp16, y = v_1_cast_fp16)[name = tensor<string, []>("x_13_cast_fp16")];
            tensor<int32, [4]> var_99_perm_0 = const()[name = tensor<string, []>("op_99_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_101 = const()[name = tensor<string, []>("op_101"), val = tensor<int32, [3]>([1, 257, 384])];
            tensor<fp16, [1, 257, 6, 64]> var_99_cast_fp16 = transpose(perm = var_99_perm_0, x = x_13_cast_fp16)[name = tensor<string, []>("transpose_116")];
            tensor<fp16, [1, 257, 384]> input_3_cast_fp16 = reshape(shape = var_101, x = var_99_cast_fp16)[name = tensor<string, []>("input_3_cast_fp16")];
            tensor<fp16, [384, 384]> backbone_blocks_0_attn_proj_weight_to_fp16 = const()[name = tensor<string, []>("backbone_blocks_0_attn_proj_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1539648)))];
            tensor<fp16, [384]> backbone_blocks_0_attn_proj_bias_to_fp16 = const()[name = tensor<string, []>("backbone_blocks_0_attn_proj_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1834624)))];
            tensor<fp16, [1, 257, 384]> linear_1_cast_fp16 = linear(bias = backbone_blocks_0_attn_proj_bias_to_fp16, weight = backbone_blocks_0_attn_proj_weight_to_fp16, x = input_3_cast_fp16)[name = tensor<string, []>("linear_1_cast_fp16")];
            tensor<fp16, [384]> backbone_blocks_0_ls1_gamma_to_fp16 = const()[name = tensor<string, []>("backbone_blocks_0_ls1_gamma_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1835456)))];
            tensor<fp16, [1, 257, 384]> var_108_cast_fp16 = mul(x = linear_1_cast_fp16, y = backbone_blocks_0_ls1_gamma_to_fp16)[name = tensor<string, []>("op_108_cast_fp16")];
            tensor<fp16, [1, 257, 384]> input_7_cast_fp16 = add(x = input_1_cast_fp16, y = var_108_cast_fp16)[name = tensor<string, []>("input_7_cast_fp16")];
            tensor<int32, [1]> input_9_axes_0 = const()[name = tensor<string, []>("input_9_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> backbone_blocks_0_norm2_weight_to_fp16 = const()[name = tensor<string, []>("backbone_blocks_0_norm2_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1836288)))];
            tensor<fp16, [384]> backbone_blocks_0_norm2_bias_to_fp16 = const()[name = tensor<string, []>("backbone_blocks_0_norm2_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1837120)))];
            tensor<fp16, [1, 257, 384]> input_9_cast_fp16 = layer_norm(axes = input_9_axes_0, beta = backbone_blocks_0_norm2_bias_to_fp16, epsilon = var_9_to_fp16, gamma = backbone_blocks_0_norm2_weight_to_fp16, x = input_7_cast_fp16)[name = tensor<string, []>("input_9_cast_fp16")];
            tensor<fp16, [1536, 384]> backbone_blocks_0_mlp_fc1_weight_to_fp16 = const()[name = tensor<string, []>("backbone_blocks_0_mlp_fc1_weight_to_fp16"), val = tensor<fp16, [1536, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1837952)))];
            tensor<fp16, [1536]> backbone_blocks_0_mlp_fc1_bias_to_fp16 = const()[name = tensor<string, []>("backbone_blocks_0_mlp_fc1_bias_to_fp16"), val = tensor<fp16, [1536]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3017664)))];
            tensor<fp16, [1, 257, 1536]> linear_2_cast_fp16 = linear(bias = backbone_blocks_0_mlp_fc1_bias_to_fp16, weight = backbone_blocks_0_mlp_fc1_weight_to_fp16, x = input_9_cast_fp16)[name = tensor<string, []>("linear_2_cast_fp16")];
            tensor<string, []> input_13_mode_0 = const()[name = tensor<string, []>("input_13_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 257, 1536]> input_13_cast_fp16 = gelu(mode = input_13_mode_0, x = linear_2_cast_fp16)[name = tensor<string, []>("input_13_cast_fp16")];
            tensor<fp16, [384, 1536]> backbone_blocks_0_mlp_fc2_weight_to_fp16 = const()[name = tensor<string, []>("backbone_blocks_0_mlp_fc2_weight_to_fp16"), val = tensor<fp16, [384, 1536]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3020800)))];
            tensor<fp16, [384]> backbone_blocks_0_mlp_fc2_bias_to_fp16 = const()[name = tensor<string, []>("backbone_blocks_0_mlp_fc2_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4200512)))];
            tensor<fp16, [1, 257, 384]> linear_3_cast_fp16 = linear(bias = backbone_blocks_0_mlp_fc2_bias_to_fp16, weight = backbone_blocks_0_mlp_fc2_weight_to_fp16, x = input_13_cast_fp16)[name = tensor<string, []>("linear_3_cast_fp16")];
            tensor<fp16, [384]> backbone_blocks_0_ls2_gamma_to_fp16 = const()[name = tensor<string, []>("backbone_blocks_0_ls2_gamma_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4201344)))];
            tensor<fp16, [1, 257, 384]> var_126_cast_fp16 = mul(x = linear_3_cast_fp16, y = backbone_blocks_0_ls2_gamma_to_fp16)[name = tensor<string, []>("op_126_cast_fp16")];
            tensor<fp16, [1, 257, 384]> input_19_cast_fp16 = add(x = input_7_cast_fp16, y = var_126_cast_fp16)[name = tensor<string, []>("input_19_cast_fp16")];
            tensor<int32, [1]> x_19_axes_0 = const()[name = tensor<string, []>("x_19_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> backbone_blocks_1_norm1_weight_to_fp16 = const()[name = tensor<string, []>("backbone_blocks_1_norm1_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4202176)))];
            tensor<fp16, [384]> backbone_blocks_1_norm1_bias_to_fp16 = const()[name = tensor<string, []>("backbone_blocks_1_norm1_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4203008)))];
            tensor<fp16, [1, 257, 384]> x_19_cast_fp16 = layer_norm(axes = x_19_axes_0, beta = backbone_blocks_1_norm1_bias_to_fp16, epsilon = var_9_to_fp16, gamma = backbone_blocks_1_norm1_weight_to_fp16, x = input_19_cast_fp16)[name = tensor<string, []>("x_19_cast_fp16")];
            tensor<fp16, [1152, 384]> backbone_blocks_1_attn_qkv_weight_to_fp16 = const()[name = tensor<string, []>("backbone_blocks_1_attn_qkv_weight_to_fp16"), val = tensor<fp16, [1152, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4203840)))];
            tensor<fp16, [1152]> backbone_blocks_1_attn_qkv_bias_to_fp16 = const()[name = tensor<string, []>("backbone_blocks_1_attn_qkv_bias_to_fp16"), val = tensor<fp16, [1152]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5088640)))];
            tensor<fp16, [1, 257, 1152]> linear_4_cast_fp16 = linear(bias = backbone_blocks_1_attn_qkv_bias_to_fp16, weight = backbone_blocks_1_attn_qkv_weight_to_fp16, x = x_19_cast_fp16)[name = tensor<string, []>("linear_4_cast_fp16")];
            tensor<int32, [5]> var_149 = const()[name = tensor<string, []>("op_149"), val = tensor<int32, [5]>([1, 257, 3, 6, 64])];
            tensor<fp16, [1, 257, 3, 6, 64]> qkv_3_cast_fp16 = reshape(shape = var_149, x = linear_4_cast_fp16)[name = tensor<string, []>("qkv_3_cast_fp16")];
            tensor<int32, [3]> var_151_split_sizes_0 = const()[name = tensor<string, []>("op_151_split_sizes_0"), val = tensor<int32, [3]>([1, 1, 1])];
            tensor<int32, []> var_151_axis_0 = const()[name = tensor<string, []>("op_151_axis_0"), val = tensor<int32, []>(2)];
            tensor<fp16, [1, 257, 1, 6, 64]> var_151_cast_fp16_0, tensor<fp16, [1, 257, 1, 6, 64]> var_151_cast_fp16_1, tensor<fp16, [1, 257, 1, 6, 64]> var_151_cast_fp16_2 = split(axis = var_151_axis_0, split_sizes = var_151_split_sizes_0, x = qkv_3_cast_fp16)[name = tensor<string, []>("op_151_cast_fp16")];
            tensor<int32, [1]> squeeze_3_axes_0 = const()[name = tensor<string, []>("squeeze_3_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<fp16, [1, 257, 6, 64]> squeeze_3_cast_fp16 = squeeze(axes = squeeze_3_axes_0, x = var_151_cast_fp16_0)[name = tensor<string, []>("squeeze_3_cast_fp16")];
            tensor<int32, [1]> squeeze_4_axes_0 = const()[name = tensor<string, []>("squeeze_4_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<fp16, [1, 257, 6, 64]> squeeze_4_cast_fp16 = squeeze(axes = squeeze_4_axes_0, x = var_151_cast_fp16_1)[name = tensor<string, []>("squeeze_4_cast_fp16")];
            tensor<int32, [1]> squeeze_5_axes_0 = const()[name = tensor<string, []>("squeeze_5_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<fp16, [1, 257, 6, 64]> squeeze_5_cast_fp16 = squeeze(axes = squeeze_5_axes_0, x = var_151_cast_fp16_2)[name = tensor<string, []>("squeeze_5_cast_fp16")];
            tensor<int32, [4]> v_3_perm_0 = const()[name = tensor<string, []>("v_3_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, []> mul_1_y_0_to_fp16 = const()[name = tensor<string, []>("mul_1_y_0_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 257, 6, 64]> mul_1_cast_fp16 = mul(x = squeeze_3_cast_fp16, y = mul_1_y_0_to_fp16)[name = tensor<string, []>("mul_1_cast_fp16")];
            tensor<bool, []> matmul_1_transpose_y_0 = const()[name = tensor<string, []>("matmul_1_transpose_y_0"), val = tensor<bool, []>(true)];
            tensor<bool, []> matmul_1_transpose_x_0 = const()[name = tensor<string, []>("matmul_1_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> transpose_50_perm_0 = const()[name = tensor<string, []>("transpose_50_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<int32, [4]> transpose_51_perm_0 = const()[name = tensor<string, []>("transpose_51_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<fp16, [1, 6, 257, 64]> transpose_51 = transpose(perm = transpose_51_perm_0, x = squeeze_4_cast_fp16)[name = tensor<string, []>("transpose_113")];
            tensor<fp16, [1, 6, 257, 64]> transpose_50 = transpose(perm = transpose_50_perm_0, x = mul_1_cast_fp16)[name = tensor<string, []>("transpose_114")];
            tensor<fp16, [1, 6, 257, 257]> matmul_1_cast_fp16 = matmul(transpose_x = matmul_1_transpose_x_0, transpose_y = matmul_1_transpose_y_0, x = transpose_50, y = transpose_51)[name = tensor<string, []>("matmul_1_cast_fp16")];
            tensor<int32, []> softmax_1_axis_0 = const()[name = tensor<string, []>("softmax_1_axis_0"), val = tensor<int32, []>(-1)];
            tensor<fp16, [1, 6, 257, 257]> softmax_1_cast_fp16 = softmax(axis = softmax_1_axis_0, x = matmul_1_cast_fp16)[name = tensor<string, []>("softmax_1_cast_fp16")];
            tensor<bool, []> x_21_transpose_x_0 = const()[name = tensor<string, []>("x_21_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> x_21_transpose_y_0 = const()[name = tensor<string, []>("x_21_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 6, 257, 64]> v_3_cast_fp16 = transpose(perm = v_3_perm_0, x = squeeze_5_cast_fp16)[name = tensor<string, []>("transpose_115")];
            tensor<fp16, [1, 6, 257, 64]> x_21_cast_fp16 = matmul(transpose_x = x_21_transpose_x_0, transpose_y = x_21_transpose_y_0, x = softmax_1_cast_fp16, y = v_3_cast_fp16)[name = tensor<string, []>("x_21_cast_fp16")];
            tensor<int32, [4]> var_159_perm_0 = const()[name = tensor<string, []>("op_159_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_161 = const()[name = tensor<string, []>("op_161"), val = tensor<int32, [3]>([1, 257, 384])];
            tensor<fp16, [1, 257, 6, 64]> var_159_cast_fp16 = transpose(perm = var_159_perm_0, x = x_21_cast_fp16)[name = tensor<string, []>("transpose_112")];
            tensor<fp16, [1, 257, 384]> input_21_cast_fp16 = reshape(shape = var_161, x = var_159_cast_fp16)[name = tensor<string, []>("input_21_cast_fp16")];
            tensor<fp16, [384, 384]> backbone_blocks_1_attn_proj_weight_to_fp16 = const()[name = tensor<string, []>("backbone_blocks_1_attn_proj_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5091008)))];
            tensor<fp16, [384]> backbone_blocks_1_attn_proj_bias_to_fp16 = const()[name = tensor<string, []>("backbone_blocks_1_attn_proj_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5385984)))];
            tensor<fp16, [1, 257, 384]> linear_5_cast_fp16 = linear(bias = backbone_blocks_1_attn_proj_bias_to_fp16, weight = backbone_blocks_1_attn_proj_weight_to_fp16, x = input_21_cast_fp16)[name = tensor<string, []>("linear_5_cast_fp16")];
            tensor<fp16, [384]> backbone_blocks_1_ls1_gamma_to_fp16 = const()[name = tensor<string, []>("backbone_blocks_1_ls1_gamma_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5386816)))];
            tensor<fp16, [1, 257, 384]> var_168_cast_fp16 = mul(x = linear_5_cast_fp16, y = backbone_blocks_1_ls1_gamma_to_fp16)[name = tensor<string, []>("op_168_cast_fp16")];
            tensor<fp16, [1, 257, 384]> input_25_cast_fp16 = add(x = input_19_cast_fp16, y = var_168_cast_fp16)[name = tensor<string, []>("input_25_cast_fp16")];
            tensor<int32, [1]> input_27_axes_0 = const()[name = tensor<string, []>("input_27_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> backbone_blocks_1_norm2_weight_to_fp16 = const()[name = tensor<string, []>("backbone_blocks_1_norm2_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5387648)))];
            tensor<fp16, [384]> backbone_blocks_1_norm2_bias_to_fp16 = const()[name = tensor<string, []>("backbone_blocks_1_norm2_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5388480)))];
            tensor<fp16, [1, 257, 384]> input_27_cast_fp16 = layer_norm(axes = input_27_axes_0, beta = backbone_blocks_1_norm2_bias_to_fp16, epsilon = var_9_to_fp16, gamma = backbone_blocks_1_norm2_weight_to_fp16, x = input_25_cast_fp16)[name = tensor<string, []>("input_27_cast_fp16")];
            tensor<fp16, [1536, 384]> backbone_blocks_1_mlp_fc1_weight_to_fp16 = const()[name = tensor<string, []>("backbone_blocks_1_mlp_fc1_weight_to_fp16"), val = tensor<fp16, [1536, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5389312)))];
            tensor<fp16, [1536]> backbone_blocks_1_mlp_fc1_bias_to_fp16 = const()[name = tensor<string, []>("backbone_blocks_1_mlp_fc1_bias_to_fp16"), val = tensor<fp16, [1536]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6569024)))];
            tensor<fp16, [1, 257, 1536]> linear_6_cast_fp16 = linear(bias = backbone_blocks_1_mlp_fc1_bias_to_fp16, weight = backbone_blocks_1_mlp_fc1_weight_to_fp16, x = input_27_cast_fp16)[name = tensor<string, []>("linear_6_cast_fp16")];
            tensor<string, []> input_31_mode_0 = const()[name = tensor<string, []>("input_31_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 257, 1536]> input_31_cast_fp16 = gelu(mode = input_31_mode_0, x = linear_6_cast_fp16)[name = tensor<string, []>("input_31_cast_fp16")];
            tensor<fp16, [384, 1536]> backbone_blocks_1_mlp_fc2_weight_to_fp16 = const()[name = tensor<string, []>("backbone_blocks_1_mlp_fc2_weight_to_fp16"), val = tensor<fp16, [384, 1536]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6572160)))];
            tensor<fp16, [384]> backbone_blocks_1_mlp_fc2_bias_to_fp16 = const()[name = tensor<string, []>("backbone_blocks_1_mlp_fc2_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7751872)))];
            tensor<fp16, [1, 257, 384]> linear_7_cast_fp16 = linear(bias = backbone_blocks_1_mlp_fc2_bias_to_fp16, weight = backbone_blocks_1_mlp_fc2_weight_to_fp16, x = input_31_cast_fp16)[name = tensor<string, []>("linear_7_cast_fp16")];
            tensor<fp16, [384]> backbone_blocks_1_ls2_gamma_to_fp16 = const()[name = tensor<string, []>("backbone_blocks_1_ls2_gamma_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7752704)))];
            tensor<fp16, [1, 257, 384]> var_186_cast_fp16 = mul(x = linear_7_cast_fp16, y = backbone_blocks_1_ls2_gamma_to_fp16)[name = tensor<string, []>("op_186_cast_fp16")];
            tensor<fp16, [1, 257, 384]> input_37_cast_fp16 = add(x = input_25_cast_fp16, y = var_186_cast_fp16)[name = tensor<string, []>("input_37_cast_fp16")];
            tensor<int32, [1]> x_27_axes_0 = const()[name = tensor<string, []>("x_27_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> backbone_blocks_2_norm1_weight_to_fp16 = const()[name = tensor<string, []>("backbone_blocks_2_norm1_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7753536)))];
            tensor<fp16, [384]> backbone_blocks_2_norm1_bias_to_fp16 = const()[name = tensor<string, []>("backbone_blocks_2_norm1_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7754368)))];
            tensor<fp16, [1, 257, 384]> x_27_cast_fp16 = layer_norm(axes = x_27_axes_0, beta = backbone_blocks_2_norm1_bias_to_fp16, epsilon = var_9_to_fp16, gamma = backbone_blocks_2_norm1_weight_to_fp16, x = input_37_cast_fp16)[name = tensor<string, []>("x_27_cast_fp16")];
            tensor<fp16, [1152, 384]> backbone_blocks_2_attn_qkv_weight_to_fp16 = const()[name = tensor<string, []>("backbone_blocks_2_attn_qkv_weight_to_fp16"), val = tensor<fp16, [1152, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7755200)))];
            tensor<fp16, [1152]> backbone_blocks_2_attn_qkv_bias_to_fp16 = const()[name = tensor<string, []>("backbone_blocks_2_attn_qkv_bias_to_fp16"), val = tensor<fp16, [1152]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8640000)))];
            tensor<fp16, [1, 257, 1152]> linear_8_cast_fp16 = linear(bias = backbone_blocks_2_attn_qkv_bias_to_fp16, weight = backbone_blocks_2_attn_qkv_weight_to_fp16, x = x_27_cast_fp16)[name = tensor<string, []>("linear_8_cast_fp16")];
            tensor<int32, [5]> var_209 = const()[name = tensor<string, []>("op_209"), val = tensor<int32, [5]>([1, 257, 3, 6, 64])];
            tensor<fp16, [1, 257, 3, 6, 64]> qkv_5_cast_fp16 = reshape(shape = var_209, x = linear_8_cast_fp16)[name = tensor<string, []>("qkv_5_cast_fp16")];
            tensor<int32, [3]> var_211_split_sizes_0 = const()[name = tensor<string, []>("op_211_split_sizes_0"), val = tensor<int32, [3]>([1, 1, 1])];
            tensor<int32, []> var_211_axis_0 = const()[name = tensor<string, []>("op_211_axis_0"), val = tensor<int32, []>(2)];
            tensor<fp16, [1, 257, 1, 6, 64]> var_211_cast_fp16_0, tensor<fp16, [1, 257, 1, 6, 64]> var_211_cast_fp16_1, tensor<fp16, [1, 257, 1, 6, 64]> var_211_cast_fp16_2 = split(axis = var_211_axis_0, split_sizes = var_211_split_sizes_0, x = qkv_5_cast_fp16)[name = tensor<string, []>("op_211_cast_fp16")];
            tensor<int32, [1]> squeeze_6_axes_0 = const()[name = tensor<string, []>("squeeze_6_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<fp16, [1, 257, 6, 64]> squeeze_6_cast_fp16 = squeeze(axes = squeeze_6_axes_0, x = var_211_cast_fp16_0)[name = tensor<string, []>("squeeze_6_cast_fp16")];
            tensor<int32, [1]> squeeze_7_axes_0 = const()[name = tensor<string, []>("squeeze_7_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<fp16, [1, 257, 6, 64]> squeeze_7_cast_fp16 = squeeze(axes = squeeze_7_axes_0, x = var_211_cast_fp16_1)[name = tensor<string, []>("squeeze_7_cast_fp16")];
            tensor<int32, [1]> squeeze_8_axes_0 = const()[name = tensor<string, []>("squeeze_8_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<fp16, [1, 257, 6, 64]> squeeze_8_cast_fp16 = squeeze(axes = squeeze_8_axes_0, x = var_211_cast_fp16_2)[name = tensor<string, []>("squeeze_8_cast_fp16")];
            tensor<int32, [4]> v_5_perm_0 = const()[name = tensor<string, []>("v_5_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, []> mul_2_y_0_to_fp16 = const()[name = tensor<string, []>("mul_2_y_0_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 257, 6, 64]> mul_2_cast_fp16 = mul(x = squeeze_6_cast_fp16, y = mul_2_y_0_to_fp16)[name = tensor<string, []>("mul_2_cast_fp16")];
            tensor<bool, []> matmul_2_transpose_y_0 = const()[name = tensor<string, []>("matmul_2_transpose_y_0"), val = tensor<bool, []>(true)];
            tensor<bool, []> matmul_2_transpose_x_0 = const()[name = tensor<string, []>("matmul_2_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> transpose_52_perm_0 = const()[name = tensor<string, []>("transpose_52_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<int32, [4]> transpose_53_perm_0 = const()[name = tensor<string, []>("transpose_53_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<fp16, [1, 6, 257, 64]> transpose_53 = transpose(perm = transpose_53_perm_0, x = squeeze_7_cast_fp16)[name = tensor<string, []>("transpose_109")];
            tensor<fp16, [1, 6, 257, 64]> transpose_52 = transpose(perm = transpose_52_perm_0, x = mul_2_cast_fp16)[name = tensor<string, []>("transpose_110")];
            tensor<fp16, [1, 6, 257, 257]> matmul_2_cast_fp16 = matmul(transpose_x = matmul_2_transpose_x_0, transpose_y = matmul_2_transpose_y_0, x = transpose_52, y = transpose_53)[name = tensor<string, []>("matmul_2_cast_fp16")];
            tensor<int32, []> softmax_2_axis_0 = const()[name = tensor<string, []>("softmax_2_axis_0"), val = tensor<int32, []>(-1)];
            tensor<fp16, [1, 6, 257, 257]> softmax_2_cast_fp16 = softmax(axis = softmax_2_axis_0, x = matmul_2_cast_fp16)[name = tensor<string, []>("softmax_2_cast_fp16")];
            tensor<bool, []> x_29_transpose_x_0 = const()[name = tensor<string, []>("x_29_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> x_29_transpose_y_0 = const()[name = tensor<string, []>("x_29_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 6, 257, 64]> v_5_cast_fp16 = transpose(perm = v_5_perm_0, x = squeeze_8_cast_fp16)[name = tensor<string, []>("transpose_111")];
            tensor<fp16, [1, 6, 257, 64]> x_29_cast_fp16 = matmul(transpose_x = x_29_transpose_x_0, transpose_y = x_29_transpose_y_0, x = softmax_2_cast_fp16, y = v_5_cast_fp16)[name = tensor<string, []>("x_29_cast_fp16")];
            tensor<int32, [4]> var_219_perm_0 = const()[name = tensor<string, []>("op_219_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_221 = const()[name = tensor<string, []>("op_221"), val = tensor<int32, [3]>([1, 257, 384])];
            tensor<fp16, [1, 257, 6, 64]> var_219_cast_fp16 = transpose(perm = var_219_perm_0, x = x_29_cast_fp16)[name = tensor<string, []>("transpose_108")];
            tensor<fp16, [1, 257, 384]> input_39_cast_fp16 = reshape(shape = var_221, x = var_219_cast_fp16)[name = tensor<string, []>("input_39_cast_fp16")];
            tensor<fp16, [384, 384]> backbone_blocks_2_attn_proj_weight_to_fp16 = const()[name = tensor<string, []>("backbone_blocks_2_attn_proj_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8642368)))];
            tensor<fp16, [384]> backbone_blocks_2_attn_proj_bias_to_fp16 = const()[name = tensor<string, []>("backbone_blocks_2_attn_proj_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8937344)))];
            tensor<fp16, [1, 257, 384]> linear_9_cast_fp16 = linear(bias = backbone_blocks_2_attn_proj_bias_to_fp16, weight = backbone_blocks_2_attn_proj_weight_to_fp16, x = input_39_cast_fp16)[name = tensor<string, []>("linear_9_cast_fp16")];
            tensor<fp16, [384]> backbone_blocks_2_ls1_gamma_to_fp16 = const()[name = tensor<string, []>("backbone_blocks_2_ls1_gamma_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8938176)))];
            tensor<fp16, [1, 257, 384]> var_228_cast_fp16 = mul(x = linear_9_cast_fp16, y = backbone_blocks_2_ls1_gamma_to_fp16)[name = tensor<string, []>("op_228_cast_fp16")];
            tensor<fp16, [1, 257, 384]> input_43_cast_fp16 = add(x = input_37_cast_fp16, y = var_228_cast_fp16)[name = tensor<string, []>("input_43_cast_fp16")];
            tensor<int32, [1]> input_45_axes_0 = const()[name = tensor<string, []>("input_45_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> backbone_blocks_2_norm2_weight_to_fp16 = const()[name = tensor<string, []>("backbone_blocks_2_norm2_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8939008)))];
            tensor<fp16, [384]> backbone_blocks_2_norm2_bias_to_fp16 = const()[name = tensor<string, []>("backbone_blocks_2_norm2_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8939840)))];
            tensor<fp16, [1, 257, 384]> input_45_cast_fp16 = layer_norm(axes = input_45_axes_0, beta = backbone_blocks_2_norm2_bias_to_fp16, epsilon = var_9_to_fp16, gamma = backbone_blocks_2_norm2_weight_to_fp16, x = input_43_cast_fp16)[name = tensor<string, []>("input_45_cast_fp16")];
            tensor<fp16, [1536, 384]> backbone_blocks_2_mlp_fc1_weight_to_fp16 = const()[name = tensor<string, []>("backbone_blocks_2_mlp_fc1_weight_to_fp16"), val = tensor<fp16, [1536, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8940672)))];
            tensor<fp16, [1536]> backbone_blocks_2_mlp_fc1_bias_to_fp16 = const()[name = tensor<string, []>("backbone_blocks_2_mlp_fc1_bias_to_fp16"), val = tensor<fp16, [1536]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10120384)))];
            tensor<fp16, [1, 257, 1536]> linear_10_cast_fp16 = linear(bias = backbone_blocks_2_mlp_fc1_bias_to_fp16, weight = backbone_blocks_2_mlp_fc1_weight_to_fp16, x = input_45_cast_fp16)[name = tensor<string, []>("linear_10_cast_fp16")];
            tensor<string, []> input_49_mode_0 = const()[name = tensor<string, []>("input_49_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 257, 1536]> input_49_cast_fp16 = gelu(mode = input_49_mode_0, x = linear_10_cast_fp16)[name = tensor<string, []>("input_49_cast_fp16")];
            tensor<fp16, [384, 1536]> backbone_blocks_2_mlp_fc2_weight_to_fp16 = const()[name = tensor<string, []>("backbone_blocks_2_mlp_fc2_weight_to_fp16"), val = tensor<fp16, [384, 1536]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10123520)))];
            tensor<fp16, [384]> backbone_blocks_2_mlp_fc2_bias_to_fp16 = const()[name = tensor<string, []>("backbone_blocks_2_mlp_fc2_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(11303232)))];
            tensor<fp16, [1, 257, 384]> linear_11_cast_fp16 = linear(bias = backbone_blocks_2_mlp_fc2_bias_to_fp16, weight = backbone_blocks_2_mlp_fc2_weight_to_fp16, x = input_49_cast_fp16)[name = tensor<string, []>("linear_11_cast_fp16")];
            tensor<fp16, [384]> backbone_blocks_2_ls2_gamma_to_fp16 = const()[name = tensor<string, []>("backbone_blocks_2_ls2_gamma_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(11304064)))];
            tensor<fp16, [1, 257, 384]> var_246_cast_fp16 = mul(x = linear_11_cast_fp16, y = backbone_blocks_2_ls2_gamma_to_fp16)[name = tensor<string, []>("op_246_cast_fp16")];
            tensor<fp16, [1, 257, 384]> input_55_cast_fp16 = add(x = input_43_cast_fp16, y = var_246_cast_fp16)[name = tensor<string, []>("input_55_cast_fp16")];
            tensor<int32, [1]> x_35_axes_0 = const()[name = tensor<string, []>("x_35_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> backbone_blocks_3_norm1_weight_to_fp16 = const()[name = tensor<string, []>("backbone_blocks_3_norm1_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(11304896)))];
            tensor<fp16, [384]> backbone_blocks_3_norm1_bias_to_fp16 = const()[name = tensor<string, []>("backbone_blocks_3_norm1_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(11305728)))];
            tensor<fp16, [1, 257, 384]> x_35_cast_fp16 = layer_norm(axes = x_35_axes_0, beta = backbone_blocks_3_norm1_bias_to_fp16, epsilon = var_9_to_fp16, gamma = backbone_blocks_3_norm1_weight_to_fp16, x = input_55_cast_fp16)[name = tensor<string, []>("x_35_cast_fp16")];
            tensor<fp16, [1152, 384]> backbone_blocks_3_attn_qkv_weight_to_fp16 = const()[name = tensor<string, []>("backbone_blocks_3_attn_qkv_weight_to_fp16"), val = tensor<fp16, [1152, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(11306560)))];
            tensor<fp16, [1152]> backbone_blocks_3_attn_qkv_bias_to_fp16 = const()[name = tensor<string, []>("backbone_blocks_3_attn_qkv_bias_to_fp16"), val = tensor<fp16, [1152]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(12191360)))];
            tensor<fp16, [1, 257, 1152]> linear_12_cast_fp16 = linear(bias = backbone_blocks_3_attn_qkv_bias_to_fp16, weight = backbone_blocks_3_attn_qkv_weight_to_fp16, x = x_35_cast_fp16)[name = tensor<string, []>("linear_12_cast_fp16")];
            tensor<int32, [5]> var_269 = const()[name = tensor<string, []>("op_269"), val = tensor<int32, [5]>([1, 257, 3, 6, 64])];
            tensor<fp16, [1, 257, 3, 6, 64]> qkv_7_cast_fp16 = reshape(shape = var_269, x = linear_12_cast_fp16)[name = tensor<string, []>("qkv_7_cast_fp16")];
            tensor<int32, [3]> var_271_split_sizes_0 = const()[name = tensor<string, []>("op_271_split_sizes_0"), val = tensor<int32, [3]>([1, 1, 1])];
            tensor<int32, []> var_271_axis_0 = const()[name = tensor<string, []>("op_271_axis_0"), val = tensor<int32, []>(2)];
            tensor<fp16, [1, 257, 1, 6, 64]> var_271_cast_fp16_0, tensor<fp16, [1, 257, 1, 6, 64]> var_271_cast_fp16_1, tensor<fp16, [1, 257, 1, 6, 64]> var_271_cast_fp16_2 = split(axis = var_271_axis_0, split_sizes = var_271_split_sizes_0, x = qkv_7_cast_fp16)[name = tensor<string, []>("op_271_cast_fp16")];
            tensor<int32, [1]> squeeze_9_axes_0 = const()[name = tensor<string, []>("squeeze_9_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<fp16, [1, 257, 6, 64]> squeeze_9_cast_fp16 = squeeze(axes = squeeze_9_axes_0, x = var_271_cast_fp16_0)[name = tensor<string, []>("squeeze_9_cast_fp16")];
            tensor<int32, [1]> squeeze_10_axes_0 = const()[name = tensor<string, []>("squeeze_10_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<fp16, [1, 257, 6, 64]> squeeze_10_cast_fp16 = squeeze(axes = squeeze_10_axes_0, x = var_271_cast_fp16_1)[name = tensor<string, []>("squeeze_10_cast_fp16")];
            tensor<int32, [1]> squeeze_11_axes_0 = const()[name = tensor<string, []>("squeeze_11_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<fp16, [1, 257, 6, 64]> squeeze_11_cast_fp16 = squeeze(axes = squeeze_11_axes_0, x = var_271_cast_fp16_2)[name = tensor<string, []>("squeeze_11_cast_fp16")];
            tensor<int32, [4]> v_7_perm_0 = const()[name = tensor<string, []>("v_7_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, []> mul_3_y_0_to_fp16 = const()[name = tensor<string, []>("mul_3_y_0_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 257, 6, 64]> mul_3_cast_fp16 = mul(x = squeeze_9_cast_fp16, y = mul_3_y_0_to_fp16)[name = tensor<string, []>("mul_3_cast_fp16")];
            tensor<bool, []> matmul_3_transpose_y_0 = const()[name = tensor<string, []>("matmul_3_transpose_y_0"), val = tensor<bool, []>(true)];
            tensor<bool, []> matmul_3_transpose_x_0 = const()[name = tensor<string, []>("matmul_3_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> transpose_54_perm_0 = const()[name = tensor<string, []>("transpose_54_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<int32, [4]> transpose_55_perm_0 = const()[name = tensor<string, []>("transpose_55_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<fp16, [1, 6, 257, 64]> transpose_55 = transpose(perm = transpose_55_perm_0, x = squeeze_10_cast_fp16)[name = tensor<string, []>("transpose_105")];
            tensor<fp16, [1, 6, 257, 64]> transpose_54 = transpose(perm = transpose_54_perm_0, x = mul_3_cast_fp16)[name = tensor<string, []>("transpose_106")];
            tensor<fp16, [1, 6, 257, 257]> matmul_3_cast_fp16 = matmul(transpose_x = matmul_3_transpose_x_0, transpose_y = matmul_3_transpose_y_0, x = transpose_54, y = transpose_55)[name = tensor<string, []>("matmul_3_cast_fp16")];
            tensor<int32, []> softmax_3_axis_0 = const()[name = tensor<string, []>("softmax_3_axis_0"), val = tensor<int32, []>(-1)];
            tensor<fp16, [1, 6, 257, 257]> softmax_3_cast_fp16 = softmax(axis = softmax_3_axis_0, x = matmul_3_cast_fp16)[name = tensor<string, []>("softmax_3_cast_fp16")];
            tensor<bool, []> x_37_transpose_x_0 = const()[name = tensor<string, []>("x_37_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> x_37_transpose_y_0 = const()[name = tensor<string, []>("x_37_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 6, 257, 64]> v_7_cast_fp16 = transpose(perm = v_7_perm_0, x = squeeze_11_cast_fp16)[name = tensor<string, []>("transpose_107")];
            tensor<fp16, [1, 6, 257, 64]> x_37_cast_fp16 = matmul(transpose_x = x_37_transpose_x_0, transpose_y = x_37_transpose_y_0, x = softmax_3_cast_fp16, y = v_7_cast_fp16)[name = tensor<string, []>("x_37_cast_fp16")];
            tensor<int32, [4]> var_279_perm_0 = const()[name = tensor<string, []>("op_279_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_281 = const()[name = tensor<string, []>("op_281"), val = tensor<int32, [3]>([1, 257, 384])];
            tensor<fp16, [1, 257, 6, 64]> var_279_cast_fp16 = transpose(perm = var_279_perm_0, x = x_37_cast_fp16)[name = tensor<string, []>("transpose_104")];
            tensor<fp16, [1, 257, 384]> input_57_cast_fp16 = reshape(shape = var_281, x = var_279_cast_fp16)[name = tensor<string, []>("input_57_cast_fp16")];
            tensor<fp16, [384, 384]> backbone_blocks_3_attn_proj_weight_to_fp16 = const()[name = tensor<string, []>("backbone_blocks_3_attn_proj_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(12193728)))];
            tensor<fp16, [384]> backbone_blocks_3_attn_proj_bias_to_fp16 = const()[name = tensor<string, []>("backbone_blocks_3_attn_proj_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(12488704)))];
            tensor<fp16, [1, 257, 384]> linear_13_cast_fp16 = linear(bias = backbone_blocks_3_attn_proj_bias_to_fp16, weight = backbone_blocks_3_attn_proj_weight_to_fp16, x = input_57_cast_fp16)[name = tensor<string, []>("linear_13_cast_fp16")];
            tensor<fp16, [384]> backbone_blocks_3_ls1_gamma_to_fp16 = const()[name = tensor<string, []>("backbone_blocks_3_ls1_gamma_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(12489536)))];
            tensor<fp16, [1, 257, 384]> var_288_cast_fp16 = mul(x = linear_13_cast_fp16, y = backbone_blocks_3_ls1_gamma_to_fp16)[name = tensor<string, []>("op_288_cast_fp16")];
            tensor<fp16, [1, 257, 384]> input_61_cast_fp16 = add(x = input_55_cast_fp16, y = var_288_cast_fp16)[name = tensor<string, []>("input_61_cast_fp16")];
            tensor<int32, [1]> input_63_axes_0 = const()[name = tensor<string, []>("input_63_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> backbone_blocks_3_norm2_weight_to_fp16 = const()[name = tensor<string, []>("backbone_blocks_3_norm2_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(12490368)))];
            tensor<fp16, [384]> backbone_blocks_3_norm2_bias_to_fp16 = const()[name = tensor<string, []>("backbone_blocks_3_norm2_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(12491200)))];
            tensor<fp16, [1, 257, 384]> input_63_cast_fp16 = layer_norm(axes = input_63_axes_0, beta = backbone_blocks_3_norm2_bias_to_fp16, epsilon = var_9_to_fp16, gamma = backbone_blocks_3_norm2_weight_to_fp16, x = input_61_cast_fp16)[name = tensor<string, []>("input_63_cast_fp16")];
